account_invoice_import_zugferd/test/invoices/ZUGFeRD_1p0_COMFORT_Einfach.pdf-ZUGFeRD-invoice.xml

<?xml version='1.0' encoding='UTF-8'?>
<rsm:CrossIndustryDocument xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:rsm="urn:ferd:CrossIndustryDocument:invoice:1p0" xmlns:ram="urn:un:unece:uncefact:data:standard:ReusableAggregateBusinessInformationEntity:12" xmlns:udt="urn:un:unece:uncefact:data:standard:UnqualifiedDataType:15">
    <rsm:SpecifiedExchangedDocumentContext>
        <ram:TestIndicator><udt:Indicator>true</udt:Indicator></ram:TestIndicator><!-- Im Echtbetrieb muss der TestIndicator entweder vollständig entfallen oder auf false stehen. -->
        <ram:GuidelineSpecifiedDocumentContextParameter>
            <ram:ID>urn:ferd:CrossIndustryDocument:invoice:1p0:comfort</ram:ID>
        </ram:GuidelineSpecifiedDocumentContextParameter>
    </rsm:SpecifiedExchangedDocumentContext>
    <rsm:HeaderExchangedDocument>
        <ram:ID>471102</ram:ID>
        <ram:Name>RECHNUNG</ram:Name>
        <ram:TypeCode>380</ram:TypeCode>
        <ram:IssueDateTime><udt:DateTimeString format="102">20130305</udt:DateTimeString></ram:IssueDateTime>
        <ram:IncludedNote>
            <ram:Content>Rechnung gemäß Bestellung vom 01.03.2013.</ram:Content>
        </ram:IncludedNote>
        <ram:IncludedNote>
            <ram:Content>Lieferant GmbH             
Lieferantenstraße 20                
80333 München               
Deutschland             
Geschäftsführer: Hans Muster
Handelsregisternummer: H A 123
</ram:Content>
<ram:SubjectCode>REG</ram:SubjectCode>
        </ram:IncludedNote>
    </rsm:HeaderExchangedDocument>
    <rsm:SpecifiedSupplyChainTradeTransaction>
        <ram:ApplicableSupplyChainTradeAgreement>
            <ram:SellerTradeParty>
                <ram:GlobalID schemeID="0088">4000001123452</ram:GlobalID>
                <ram:Name>Lieferant GmbH</ram:Name>
                <ram:PostalTradeAddress>
                    <ram:PostcodeCode>80333</ram:PostcodeCode>
                    <ram:LineOne>Lieferantenstraße 20</ram:LineOne>
                    <ram:CityName>München</ram:CityName>
                    <ram:CountryID>DE</ram:CountryID>
                </ram:PostalTradeAddress>
                <ram:SpecifiedTaxRegistration>
                    <ram:ID schemeID="FC">201/113/40209</ram:ID>
                </ram:SpecifiedTaxRegistration>
                <ram:SpecifiedTaxRegistration>
                    <ram:ID schemeID="VA">DE123456789</ram:ID>
                </ram:SpecifiedTaxRegistration>
            </ram:SellerTradeParty>
            <ram:BuyerTradeParty>
                <ram:ID>GE2020211</ram:ID>
                <ram:GlobalID schemeID="0088">4000001987658</ram:GlobalID>
                <ram:Name>Kunden AG Mitte</ram:Name>
                <ram:DefinedTradeContact>
                    <ram:PersonName>Hans Muster</ram:PersonName>
                </ram:DefinedTradeContact>
                <ram:PostalTradeAddress>
                    <ram:PostcodeCode>69876</ram:PostcodeCode>
                    <ram:LineOne>Kundenstraße 15</ram:LineOne>
                    <ram:CityName>Frankfurt</ram:CityName>
                    <ram:CountryID>DE</ram:CountryID>
                </ram:PostalTradeAddress>
            </ram:BuyerTradeParty>
        </ram:ApplicableSupplyChainTradeAgreement>
        <ram:ApplicableSupplyChainTradeDelivery>
            <ram:ActualDeliverySupplyChainEvent>
                <ram:OccurrenceDateTime><udt:DateTimeString format="102">20130305</udt:DateTimeString> </ram:OccurrenceDateTime>
            </ram:ActualDeliverySupplyChainEvent>
        </ram:ApplicableSupplyChainTradeDelivery>
        <ram:ApplicableSupplyChainTradeSettlement>
            <ram:PaymentReference>2013-471102</ram:PaymentReference>
            <ram:InvoiceCurrencyCode>EUR</ram:InvoiceCurrencyCode>
            <ram:SpecifiedTradeSettlementPaymentMeans>
                <ram:TypeCode>31</ram:TypeCode>
                <ram:Information>Überweisung</ram:Information>
                <ram:PayeePartyCreditorFinancialAccount>
                    <ram:IBANID>DE08700901001234567890</ram:IBANID>
                </ram:PayeePartyCreditorFinancialAccount>
                <ram:PayeeSpecifiedCreditorFinancialInstitution>
                    <ram:BICID>GENODEF1M04</ram:BICID>
                </ram:PayeeSpecifiedCreditorFinancialInstitution>
            </ram:SpecifiedTradeSettlementPaymentMeans>
            <ram:ApplicableTradeTax>
                <ram:CalculatedAmount currencyID="EUR">19.25</ram:CalculatedAmount>
                <ram:TypeCode>VAT</ram:TypeCode>
                <ram:BasisAmount currencyID="EUR">275.00</ram:BasisAmount>
                <ram:CategoryCode>S</ram:CategoryCode>
                <ram:ApplicablePercent>7.00</ram:ApplicablePercent>
            </ram:ApplicableTradeTax>
            <ram:ApplicableTradeTax>
                <ram:CalculatedAmount currencyID="EUR">37.62</ram:CalculatedAmount>
                <ram:TypeCode>VAT</ram:TypeCode>
                <ram:BasisAmount currencyID="EUR">198.00</ram:BasisAmount>
                <ram:CategoryCode>S</ram:CategoryCode>
                <ram:ApplicablePercent>19.00</ram:ApplicablePercent>
            </ram:ApplicableTradeTax>
            <ram:SpecifiedTradePaymentTerms>
                <ram:Description>Zahlbar innerhalb 30 Tagen netto bis 04.04.2013, 3% Skonto innerhalb 10 Tagen bis 15.03.2013</ram:Description>
                <ram:DueDateDateTime><udt:DateTimeString format="102">20130404</udt:DateTimeString></ram:DueDateDateTime>
            </ram:SpecifiedTradePaymentTerms>
            <ram:SpecifiedTradeSettlementMonetarySummation>
                <ram:LineTotalAmount currencyID="EUR">473.00</ram:LineTotalAmount>
                <ram:ChargeTotalAmount currencyID="EUR">0.00</ram:ChargeTotalAmount>
                <ram:AllowanceTotalAmount currencyID="EUR">0.00</ram:AllowanceTotalAmount>
                <ram:TaxBasisTotalAmount currencyID="EUR">473.00</ram:TaxBasisTotalAmount>
                <ram:TaxTotalAmount currencyID="EUR">56.87</ram:TaxTotalAmount>
                <ram:GrandTotalAmount currencyID="EUR">529.87</ram:GrandTotalAmount>
                <ram:TotalPrepaidAmount currencyID="EUR">0.00</ram:TotalPrepaidAmount>
                <ram:DuePayableAmount currencyID="EUR">529.87</ram:DuePayableAmount>
            </ram:SpecifiedTradeSettlementMonetarySummation>
        </ram:ApplicableSupplyChainTradeSettlement>
        <ram:IncludedSupplyChainTradeLineItem>
            <ram:AssociatedDocumentLineDocument>
                <ram:LineID>1</ram:LineID>
            </ram:AssociatedDocumentLineDocument>
            <ram:SpecifiedSupplyChainTradeAgreement>
                <ram:GrossPriceProductTradePrice>
                    <ram:ChargeAmount currencyID="EUR">9.9000</ram:ChargeAmount>
                </ram:GrossPriceProductTradePrice>
                <ram:NetPriceProductTradePrice>
                    <ram:ChargeAmount currencyID="EUR">9.9000</ram:ChargeAmount>
                </ram:NetPriceProductTradePrice>
            </ram:SpecifiedSupplyChainTradeAgreement>
            <ram:SpecifiedSupplyChainTradeDelivery>
                <ram:BilledQuantity unitCode="C62">20.0000</ram:BilledQuantity>
            </ram:SpecifiedSupplyChainTradeDelivery>
            <ram:SpecifiedSupplyChainTradeSettlement>
                <ram:ApplicableTradeTax>
                    <ram:TypeCode>VAT</ram:TypeCode>
                    <ram:CategoryCode>S</ram:CategoryCode>
                    <ram:ApplicablePercent>19.00</ram:ApplicablePercent>
                </ram:ApplicableTradeTax>
                <ram:SpecifiedTradeSettlementMonetarySummation>
                    <ram:LineTotalAmount currencyID="EUR">198.00</ram:LineTotalAmount>
                </ram:SpecifiedTradeSettlementMonetarySummation>
            </ram:SpecifiedSupplyChainTradeSettlement>
            <ram:SpecifiedTradeProduct>
                <ram:GlobalID schemeID="0160">4012345001235</ram:GlobalID>
                <ram:SellerAssignedID>TB100A4</ram:SellerAssignedID>
                <ram:Name>Trennblätter A4</ram:Name>
            </ram:SpecifiedTradeProduct>
        </ram:IncludedSupplyChainTradeLineItem>
        <ram:IncludedSupplyChainTradeLineItem>
            <ram:AssociatedDocumentLineDocument>
                <ram:LineID>2</ram:LineID>
            </ram:AssociatedDocumentLineDocument>
            <ram:SpecifiedSupplyChainTradeAgreement>
                <ram:GrossPriceProductTradePrice>
                    <ram:ChargeAmount currencyID="EUR">5.5000</ram:ChargeAmount>
                </ram:GrossPriceProductTradePrice>
                <ram:NetPriceProductTradePrice>
                    <ram:ChargeAmount currencyID="EUR">5.5000</ram:ChargeAmount>
                </ram:NetPriceProductTradePrice>
            </ram:SpecifiedSupplyChainTradeAgreement>
            <ram:SpecifiedSupplyChainTradeDelivery>
                <ram:BilledQuantity unitCode="C62">50.0000</ram:BilledQuantity>
            </ram:SpecifiedSupplyChainTradeDelivery>
            <ram:SpecifiedSupplyChainTradeSettlement>
                <ram:ApplicableTradeTax>
                    <ram:TypeCode>VAT</ram:TypeCode>
                    <ram:CategoryCode>S</ram:CategoryCode>
                    <ram:ApplicablePercent>7.00</ram:ApplicablePercent>
                </ram:ApplicableTradeTax>
                <ram:SpecifiedTradeSettlementMonetarySummation>
                    <ram:LineTotalAmount currencyID="EUR">275.00</ram:LineTotalAmount>
                </ram:SpecifiedTradeSettlementMonetarySummation>
            </ram:SpecifiedSupplyChainTradeSettlement>
            <ram:SpecifiedTradeProduct>
                <ram:GlobalID schemeID="0160">4000050986428</ram:GlobalID>
                <ram:SellerAssignedID>ARNR2</ram:SellerAssignedID>
                <ram:Name>Joghurt Banane</ram:Name>
            </ram:SpecifiedTradeProduct>
        </ram:IncludedSupplyChainTradeLineItem>     
    </rsm:SpecifiedSupplyChainTradeTransaction>
</rsm:CrossIndustryDocument>
